bunhug/app/controllers/api/v1/listings_controller.rb

        def set_listing
            @listing = Listing.find(params[:id])
---
SELECT `listings`.* FROM `listings` WHERE `listings`.`id` = 1 ORDER BY `listings`.`created_at` DESC LIMIT 1