app/controllers/api/v1/item_galleries_controller.rb

    def show
        @galleries = ItemGallery.all
---
SELECT `item_galleries`.* FROM `item_galleries`