app/controllers/api/v1/listings_controller.rb

    def update
        listing = current_user.listings.find_by(slug: params[:slug])
---
SELECT "listings".* FROM "listings" WHERE "listings"."slug" = $1 LIMIT $2  [["slug", "fake-added-listing"], ["LIMIT", 1]]

    def destroy
       listing = current_user.listings.find_by(slug: params[:slug])
---
SELECT "listings".* FROM "listings" WHERE "listings"."slug" = $1 LIMIT $2  [["slug", "fake-added-listing"], ["LIMIT", 1]]

    def listing
      @listing ||= Listing.find_by(slug: params[:slug])
---
SELECT "listings".* FROM "listings" WHERE "listings"."slug" = $1 LIMIT $2  [["slug", "listing-1-user1"], ["LIMIT", 1]]