app/controllers/api/v1/listings_controller.rb

  def index
    @listings = current_user.listings.all
---
SELECT "listings".* FROM "listings"

  def create
    @listing= current_user.listings.build(listing_params)

    if authorized?
      respond_to do |format|
        if @listing.save
---
INSERT INTO `listings` (`title`, `user_id`, `category`, `image_url`, `details`, `colour`, `price`, `created_at`, `updated_at`) VALUES ('s', 1, 'd', 'f', 'g', 'h', 0.0, '2021-03-12 08:29:33.741740', '2021-03-12 08:29:33.741740')

  def update
    if authorized?
      respond_to do |format|
        if @listing.update(listing_params)
---
UPDATE `listings` SET `listings`.`title` = '6.0', `listings`.`category` = '6.0', `listings`.`image_url` = '6.0', `listings`.`details` = '6.0', `listings`.`colour` = '6.0', `listings`.`active` = FALSE, `listings`.`updated_at` = '2021-03-12 08:44:32.653866' WHERE `listings`.`id` = 31

  def destroy
    if authorized?
      @listing.destroy
---
DELETE FROM `listings` WHERE `listings`.`id` = 21

    def set_listing
      @listing= Listing.find(params[:id])
---
SELECT `listings`.* FROM `listings` WHERE `listings`.`id` = 21 ORDER BY `listings`.`created_at` DESC LIMIT 1