app/controllers/api/v1/reviews_controller.rb

      def index
        reviews = Review.all
---
SELECT "reviews".* FROM "reviews"